## Loading (and Extracting) Datasets

In [1]:
import pandas as pd

#### CSV

The _.csv_ extension stands for "Comma Seperated Values".  As most database prorammers know, it is a "flat" text file with records (or rows) separated by delimeters (typically, but not limited to commas) used by an ETL (Extract, Transform, Load) used to populate a database table.

In [2]:
filePathCSV ='http://samplecsvs.s3.amazonaws.com/TechCrunchcontinentalUSA.csv'

The sample CSV file is from: https://support.spatialkey.com/spatialkey-sample-csv-data/

In [3]:
dfCSV = pd.read_csv(filePathCSV)

In [4]:
dfCSV.head()

,permalink,company,numEmps,category,city,state,fundedDate,raisedAmt,raisedCurrency,round
0,lifelock,LifeLock,NaN,web,Tempe,AZ,1-May-07,6850000,USD,b
1,lifelock,LifeLock,NaN,web,Tempe,AZ,1-Oct-06,6000000,USD,a
2,lifelock,LifeLock,NaN,web,Tempe,AZ,1-Jan-08,25000000,USD,c
3,mycityfaces,MyCityFaces,7.0,web,Scottsdale,AZ,1-Jan-08,50000,USD,seed
4,flypaper,Flypaper,NaN,web,Phoenix,AZ,1-Feb-08,3000000,USD,a

NOTE: By default, the _.head_ method displays the first five row so you have some idea of what was loaded into the Dataframe.  However, you can specify a paramater (between the parentheses) as to the number of records based on your preferences.

In [5]:
columnsCSV = ['company', 'category']

In [6]:
dfCSVsubset = pd.read_csv(filePathCSV, usecols=columnsCSV)

In [7]:
dfCSVsubset.head()

       company category
0     LifeLock      web
1     LifeLock      web
2     LifeLock      web
3  MyCityFaces      web
4     Flypaper      web

TIP: You can use the _usecols_ paramter to limit which portion of the CSV is loaded into the DataFrame: tantamount to an extraction.  This saves on bandwith and storage requirements.

In [8]:
filePathCSVZip =  'http://eforexcel.com/wp/wp-content/uploads/2017/07/100-Sales-Records.zip'

The sample zipped CSV file is from: http://eforexcel.com/wp/downloads-18-sample-csv-files-data-sets-for-testing-sales/

In [9]:
dfCSVZip = pd.read_csv(filePathCSVZip)

In [10]:
dfCSVZip.head(7)

,Region,Country,Item Type,Sales Channel,Order Priority,Order Date,Order ID,Ship Date,Units Sold,Unit Price,Unit Cost,Total Revenue,Total Cost,Total Profit
0,Australia and Oceania,Tuvalu,Baby Food,Offline,H,5/28/2010,669165933,6/27/2010,9925,255.28,159.42,2533654.00,1582243.50,951410.50
1,Central America and the Caribbean,Grenada,Cereal,Online,C,8/22/2012,963881480,9/15/2012,2804,205.70,117.11,576782.80,328376.44,248406.36
2,Europe,Russia,Office Supplies,Offline,L,5/2/2014,341417157,5/8/2014,1779,651.21,524.96,1158502.59,933903.84,224598.75
3,Sub-Saharan Africa,Sao Tome and Principe,Fruits,Online,C,6/20/2014,514321792,7/5/2014,8102,9.33,6.92,75591.66,56065.84,19525.82
4,Sub-Saharan Africa,Rwanda,Office Supplies,Offline,L,2/1/2013,115456712,2/6/2013,5062,651.21,524.96,3296425.02,2657347.52,639077.50
5,Australia and Oceania,Solomon Islands,Baby Food,Online,C,2/4/2015,547995746,2/21/2015,2974,255.28,159.42,759202.72,474115.08,285087.64
6,Sub-Saharan Africa,Angola,Household,Offline,M,4/23/2011,135425221,4/27/2011,4187,668.27,502.54,2798046.49,2104134.98,693911.51

NOTE:  As a matter of convenience, there is no need to download and zip file if it contains only a single CSV file. Alternatively, you can use the **wget** function if you need it locally.

# Excel

If not yet installed in your environment, you will need to download a module  called **xlrd** which allows yoy to read in excel files.

In [11]:
!pip install xlrd

Collecting xlrd
  Downloading https://files.pythonhosted.org/packages/b0/16/63576a1a001752e34bf8ea62e367997530dc553b689356b9879339cf45a4/xlrd-1.2.0-py2.py3-none-any.whl (103kB)
     |████████████████████████████████| 112kB 5.5MB/s eta 0:00:01
Installing collected packages: xlrd
Successfully installed xlrd-1.2.0

In [12]:
# conda install -c anaconda xlrd --yes

NOTE:  Effectively, they can be used to do similar things.  **pip** is specifically used for package management in Python and a "recursive"  acronym for "**pip** installs packages".  I tend to use it rather than **conda** as parameters tend to shorter.

In [13]:
dfXLSX = pd.read_excel('https://file-examples.com/wp-content/uploads/2017/02/file_example_XLSX_5000.xlsx')

print ('Data read into a pandas dataframe!')

Data read into a pandas dataframe!

In [14]:
dfXLSX.head(5)

,Unnamed: 0,First Name,Last Name,Gender,Country,Age,Date,Id
0,1,Dulce,Abril,Female,United States,32,15/10/2017,1562
1,2,Mara,Hashimoto,Female,Great Britain,25,16/08/2016,1582
2,3,Philip,Gent,Male,France,36,21/05/2015,2587
3,4,Kathleen,Hanner,Female,United States,25,15/10/2017,3549
4,5,Nereida,Magwood,Female,United States,58,16/08/2016,2468

In [15]:
filePathXLS = 'https://file-examples.com/wp-content/uploads/2017/02/file_example_XLS_5000.xls'

In [16]:
dfXLS = pd.read_excel(filePathXLS)

print ('Data read into a pandas dataframe!')

Data read into a pandas dataframe!

In [17]:
dfXLS.head(3)

,Unnamed: 0,First Name,Last Name,Gender,Country,Age,Date,Id
0,1,Dulce,Abril,Female,United States,32,15/10/2017,1562
1,2,Mara,Hashimoto,Female,Great Britain,25,16/08/2016,1582
2,3,Philip,Gent,Male,France,36,21/05/2015,2587

NOTE:  By default Python assume tnere's only a sheet in your spreadsheet.  However if the file has multiple sheets, ther's a  parameter called  _sheet_name_ that allows you to specicy  which one to use.  You can refer to the official Python documentation for a complete list of parameters recognised:  https://pandas.pydata.org/pandas-docs/stable/reference/api/pandas.read_excel.html

NOTE: the _.xls_ file extenion represents a Microsoft Excel spreadsheet, whilt the last 'x' in _.xlsx_ stands for the open standard of **XML**.

In [18]:
columnsXLS = ['First Name', 'Last Name']

In [19]:
dfXLSsubset = pd.read_excel(filePathXLS, usecols=columnsXLS, nrows=5 )

print ('Data read into a pandas dataframe!')

Data read into a pandas dataframe!

In [20]:
dfXLSsubset

  First Name  Last Name
0      Dulce      Abril
1       Mara  Hashimoto
2     Philip       Gent
3   Kathleen     Hanner
4    Nereida    Magwood

NOTE: In both cases, you can use the _usecols_ parameter to "select" which columns to include. As far as I know, you can use the _nrows_ parametre to specify how many rows to read.

TIP: There is a write equivalent for the various file formats. It is in the form of _.to__*_ which I find useful so I can access it locally and not chew up bandwidth.

NOTE: You might as how much data can be loaded onto the Dataframe?  The answer is it depends.  This is mainly dependent on the amount of memory avaible on the "local" environment.

### More Information about the Dataset

In [21]:
dfXLS.tail()

,Unnamed: 0,First Name,Last Name,Gender,Country,Age,Date,Id
4995,4996,Roma,Lafollette,Female,United States,34,15/10/2017,2654
4996,4997,Felisa,Cail,Female,United States,28,16/08/2016,6525
4997,4998,Demetria,Abbey,Female,United States,32,21/05/2015,3265
4998,4999,Jeromy,Danz,Male,United States,39,15/10/2017,3265
4999,5000,Rasheeda,Alkire,Female,United States,29,16/08/2016,6125

The "opposite" of _.head_ - used to get the last value of the DataFrame.

In [22]:
dfXLS.columns.values

array(['Unnamed: 0', 'First Name', 'Last Name', 'Gender', 'Country',
       'Age', 'Date', 'Id'], dtype=object)

Used to get the column names.

In [23]:
dfXLS.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5000 entries, 0 to 4999
Data columns (total 8 columns):
Unnamed: 0    5000 non-null int64
First Name    5000 non-null object
Last Name     5000 non-null object
Gender        5000 non-null object
Country       5000 non-null object
Age           5000 non-null int64
Date          5000 non-null object
Id            5000 non-null int64
dtypes: int64(3), object(5)
memory usage: 312.6+ KB

Used to get an idea about the dataset's structure

### Unconcsious Bias

I consider myself an "objective" person but it may be a good idea to involve other persons, if at all feasible, in the selection of datasets - if you've never considered this then you'll be "floored" to know that there might have been "unconscius or implicit bias" in its construction. I am not advocating you need to disregrd all datasets, but like everything, you need to consider the source. Which datset you end up using can yield very different results so it is important you "preface" any finding(s) with caveat(s).